oscillating_airfoil2D/case-SA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;  
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; 

#include        "include/freestreamConditions"
internalField   uniform $U; 

boundaryField
{
  far
  {
        type            freestreamVelocity;
        freestreamValue $internalField;
  }
  background_ymin
  {
        type            empty;
  }
  airfoilzone_ymin
  {
        type            empty;
  }
  airfoil_surface
  {
        type            movingWallVelocity;
        value           uniform (0 0 0);
  }
  #include        "include/cyclicAMI"
}
