oscillating_airfoil2D/case-SA/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0]; 

internalField uniform     1.42e-4;

boundaryField
{
  far
  {
        type            freestream;
        freestreamValue $internalField;
        freestreamBC    fixedValue;
  }
  background_ymin
  {
        type            empty;
  }
  background_ymin
  {
        type            empty;
  }
  airfoil_surface
  {
        type            fixedValue;
        value           uniform 0;
  }
  #include        "include/cyclicAMI"
}
